app/views/comments/_index.html.erb

                <span class="comment-date pull-right">
                      <%= comment.created_at.strftime('%Y/%m/%d %H:%M:%S') %>
---
INSERT INTO "comments" ("content", "user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dsds"], ["user_id", 1], ["micropost_id", 3], ["created_at", "2021-12-18 09:56:28.939428"], ["updated_at", "2021-12-18 09:56:28.939428"]]