app/views/users/show.html.erb


        <% if @user.microposts.any? %>
          <h3 class="col-12 d-flex justify-content-center">Openion (<%= @user.microposts.count %>)</h3>
---
SELECT  1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]