app/views/microposts/show.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."micropost_id" = ?  [["micropost_id", 3]]
---
        <td>
          <h3><i class="fas fa-heart unlike-btn"></i>: <%= @micropost.likes.count %></h3>