app/controllers/comments_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "dsds"], ["user_id", 1], ["micropost_id", 3], ["created_at", "2021-12-18 09:56:28.939428"], ["updated_at", "2021-12-18 09:56:28.939428"]]
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ? LIMIT -1 OFFSET ?  [["micropost_id", 3], ["OFFSET", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def create
    @micropost = Micropost.find(params[:micropost_id])
    @comment = @micropost.comments.build(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
      flash[:success] = '投稿にコメントしました。'
      redirect_back(fallback_location: root_path)
    else
      @micropost = Micropost.find(params[:micropost_id])
　　　@comments = @micropost.comments.includes(:user)