app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["micropost_id", 3], ["created_at", "2021-12-18 09:56:39.256411"], ["updated_at", "2021-12-18 09:56:39.256411"]]
---
  def create
    @like = current_user.likes.create(micropost_id: params[:micropost_id])

SELECT  "likes".* FROM "likes" WHERE "likes"."micropost_id" = ? AND "likes"."user_id" = ? LIMIT ?  [["micropost_id", 3], ["user_id", 4], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
  def destroy
    @like = Like.find_by(post_id: params[:micropost_id], user_id: current_user.id)
    @like.destroy