app/controllers/microposts_controller.rb

  def create
    @micropost = Micropost.new(micropost_params)
    @micropost.user_id = current_user.id
    @micropost.save!
---
INSERT INTO "microposts" ("user_id", "content", "image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["content", "sa"], ["image_id", nil], ["created_at", "2021-12-18 08:48:28.658261"], ["updated_at", "2021-12-18 08:48:28.658261"]]

  def index
    @microposts = Micropost.all
---
SELECT "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC

  def show
    @micropost = Micropost.find(params[:id])
    @microposts = Micropost.all
    @like = Like.new
    @comments = @micropost.comments.includes(:user)
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ? ORDER BY "comments"."created_at" DESC LIMIT -1 OFFSET ?  [["micropost_id", 3], ["OFFSET", 2]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @micropost = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @micropost = Micropost.find(params[:id])
    if @micropost.update(micropost_params)
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "microposts" SET "content" = ?, "image_id" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["content", "dadada"], ["image_id", nil], ["updated_at", "2021-12-21 13:08:55.992032"], ["id", 4]]

  def destroy
    @micropost = Micropost.find(params[:id])
    @micropost.destroy
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 4]]