app/controllers/microposts_controller.rb

  def index
    @microposts = Micropost.all.order(created_at: :desc).includes(:user,:tags)
---
SELECT "tags".* FROM "tags" WHERE "tags"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 4], ["id", 1]]