app/controllers/users_controller.rb

UPDATE "users" SET "is_active" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["is_active", 0], ["updated_at", "2021-12-19 08:22:29.766584"], ["id", 1]]
---
  def withdraw
    @user = current_user
    @user.update(is_active: false)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def following
    @title = "フォロー"
    @user  = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def followers
    @title = "フォロワー"
    @user  = User.find(params[:id])