app/models/user.rb

  def follow(other_user)
    active_relationships.create(followed_id: other_user.id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 3], ["followed_id", 1], ["created_at", "2021-12-19 08:46:09.665197"], ["updated_at", "2021-12-19 08:46:09.665197"]]