app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "k@p"], ["LIMIT", 1]]
---
  def reject_inactive_user #退会済みユーザーのログイン拒否
    @user = User.find_by(email: params[:user][:email].downcase)